backend/services/GetChannelDataServices.php

SELECT COUNT(*) FROM `loan_users` WHERE (`create_time` >= '2019-03-06 00:00:00') AND (`create_time` <= '2019-03-07 00:00:00') AND (`channel_id`='011')
---
    public static function statsRegisterData($date, $channel_id)
    {
        $date_begin = date("Y-m-d H:i:s", strtotime($date));
        $date_end = date("Y-m-d H:i:s", strtotime($date) + 24 * 60 * 60);

        // 1.统计注册数据
        $register_count = LoanUsers::find()
            ->where([">=", 'create_time', $date_begin])
            ->andWhere(["<=", 'create_time', $date_end])
            ->andWhere(["channel_id" => $channel_id])
            ->count();

SELECT COUNT(*) FROM `loan_login_log` INNER JOIN `loan_users` ON loan_users.id = loan_login_log.user_id WHERE (`loan_login_log`.`create_time` >= '2019-03-06 00:00:00') AND (`loan_login_log`.`create_time` <= '2019-03-07 00:00:00') AND (`loan_users`.`channel_id`='011')
---
    public static function statsLoginData($date, $channel_id)
    {
        $date_begin = date("Y-m-d H:i:s", strtotime($date));
        $date_end = date("Y-m-d H:i:s", strtotime($date) + 24 * 60 * 60);

        // 2.统计登陆数
        $login_data = LoanLoginLog::find()
            ->innerJoin("loan_users", "loan_users.id = loan_login_log.user_id")
            ->where([">=", 'loan_login_log.create_time', $date_begin])
            ->andWhere(["<=", 'loan_login_log.create_time', $date_end])
            ->andWhere(["loan_users.channel_id" => $channel_id])
            ->count();