common/models/Admin.php

SELECT * FROM `admin` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);

SELECT * FROM `admin` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);