common/models/ChannelAccount.php

SELECT * FROM `channel_account` WHERE `username`='user2'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);

SELECT * FROM `channel_account` WHERE `id`=83
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);